const softwareData = {
  "swChoice": [
    {
      "text": "1、具有风险分析的软件生命周期模型是( )。\nA.瀑布模型\nB.喷泉模型\nC.螺旋模型\nD.增量模型",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "2、软件工程的基本要素包括方法、工具和( )。\nA. 过程\nB. 软件系统\nC. 硬件环境\nD. 人员",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "3、在结构化分析方法中，( )表达系统内部数据运动的图形化技术。\nA. 数据字典\nB. 实体关系图\nC. 数据流图\nD. 状态转换图",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "4、“软件危机”是指( )。\nA.计算机病毒的出现\nB．利用计算机进行经济犯罪活动\nC．软件开发和维护中出现的一系列问题\nD．人们过分迷恋计算机系统",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "5、软件维护费用高的主要原因是( )。\nA、人员少\nB、人员多\nC、生产率低\nD、生产率高",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "6、随着软硬件环境变化而修改软件的过程是( )。\nA．校正性维护\nB．适应性维护\nC．完善性维护\nD．预防性维护",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "7、需求分析中开发人员要从用户那里了解( )。\nA．软件做什么\nB．用户使用界面\nC．输入的信息\nD．软件的规模",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "8、软件详细设计的主要任务是确定每个模块的( )。\nA．算法和使用的数据结构\nB．外部接口\nC．功能\nD．编程",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "9、为了提高模块的独立性，模块内部最好是( )。\nA．逻辑内聚\nB．时间内聚\nC．功能内聚\nD．通信内聚",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "10、一个模块的( )太大一般是因为缺乏中间层次，应当适当增加中间层次的控制模块。\nA．深度\nB. 宽度\nC. 扇出\nD. 扇入",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "11、模块的内聚性最高的是( )。\nA．逻辑内聚\nB．时间内聚\nC． 偶然内聚\nD．功能内聚",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "12、需求分析是( )。\nA. 软件开发工作的基础\nB. 软件生存周期的开始\nC. 由系统分析员单独完成的\nD. 由用户自己单独完成的",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "13、在白盒测试技术测试用例的设计中，( )是最强的覆盖标准。\nA．语句覆盖\nB．路径覆盖\nC． 条件组合覆盖\nD．判定覆盖",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "14、软件维护时，对测试阶段未发现的错误进行测试、诊断、定位、纠错，直至修改的回归测试过程称( )。\nA. 改正性维护\nB. 适应性维护\nC. 完善性维护\nD. 预防性维护",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "15、( ) 是把对象的属性和操作结合在一起，构成一个独立的对象，其内部信息对外界是隐蔽的，外界只能通过有限的接口与对象发生联系。\nA. 多态性\nB. 继承\nC. 封装\nD. 消息",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "16、对象实现了数据和操作的结合，使数据和操作( )于对象的统一体中。\nA．结合\nB．隐藏\nC．封装\nD．抽象",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "17、瀑布模型本质上是一种( )模型。\nA线性顺序 B顺序迭代\nC线性迭代 D及早见产品",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "18、( )意味着一个操作在不同的类中可以有不同的实现方式。\nA．多态性\nB．多继承\nC．类的可复用\nD．信息隐藏",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "19、单元测试的测试用例主要根据( )的结果来设计。\nA．需求分析\nB．源程序\nC．概要设计\nD．详细设计",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "20、软件测试是为了( )而执行程序的过程。\nA. 纠正错误\nB. 发现错误\nC. 避免错误\nD. 证明正确",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "21、汽车有一个发动机，汽车和发动机之间的关系是( )关系。\nA.一般与具体\nB.整体与部分\nC.分类\nD. is a",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "22、支持面向对象技术的软件生存周期模型是( )。\nA.喷泉模型\nB.螺旋模型\nC.增量模型\nD.瀑布模型",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "23、在白盒测试技术测试用例的设计中，( )是最弱的覆盖标准。\nA．语句覆盖\nB．路径覆盖\nC．条件组合覆盖\nD．判定覆盖",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "24、下面哪些测试方法属于白盒测试( )（多选）。\nA、基本路径测试\nB、等价类划分\nC、边界值分析\nD、错误推测\nE、逻辑覆盖测试",
      "answer": "参考答案：A、E",
      "images": []
    },
    {
      "text": "25、瀑布模型把软件生命周期划分为七个阶段：问题的定义、可行性研究、软件需求分析、系统设计、编码、测试，运行与维护。七个阶段又可归纳为三个大的阶段：计划阶段、开发阶段和( )。\nA、详细计划\nB、可行性分析\nC、运行阶段\nD、测试与排错",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "26、从结构化的瀑布模型看，在它的生命周期中的七个阶段中，下面的几个选项中哪个环节出错，对软件的影响最大( )。\nA、详细设计阶段\nB、概要设计阶段\nC、需求分析阶段\nD、测试和运行阶段",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "27、在结构化的瀑布模型中，哪一个阶段定义的标准将成为软件测试中的系统测试阶段的目标( )。\nA、需求分析阶段\nB、详细设计阶段\nC、概要设计阶段\nD、可行性研究阶段",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "28、软件工程的出现主要是由于( )。\nA.程序设计方法学的影响\nB.其它工程科学的影响\nC.软件危机的出现\nD.计算机的发展",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "29、软件工程方法学的目的是：使软件生产规范化和工程化，而软件工程方法得以实施的主要保证是( )\nA、硬件环境\nB、软件开发的环境\nC、软件开发工具和软件开发的环境\nD、开发人员的素质",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "30、 DFD中的每个加工至少有( )。\nA、一个输入流或一个输出流\nB、一个输入流和一个输出流\nC、一个输入流\nD、一个输出流",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "31、UML是软件开发中的一个重要工具，它主要应用于哪种软件开发方法( )\nA、基于瀑布模型的结构化方法\nB、基于需求动态定义的原型化方法\nC、基于对象的面向对象的方法\nD、基于数据的数据流开发方法",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "32、瀑布模型存在问题是( )\nA 用户容易参与开发\nB 缺乏灵活性\nC 用户与开发者易沟通\nD 适用可变需求",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "33、结构化分析方法是一种预先严格定义需求的方法，它在实施时强调的是分析对象的( )\nA、控制流\nB、数据流\nC、程序流\nD、指令流",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "34、软件开发的结构化生命周期方法将软件生命周期划分成( )\nA、 计划阶段、开发阶段、运行阶段\nB、 计划阶段、编程阶段、测试阶段\nC、 总体设计、详细设计、编程调试\nD、需求分析、功能定义、系统设计",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "35、可行性研究主要从以下几个方面进行研究：( )\nA 技术可行性，经济可行性，操作可行性\nB技术可行性，经济可行性，系统可行性\nC经济可行性，系统可行性，操作可行性\nD经济可行性，系统可行性，时间可行性",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "36、耦合是对软件不同模块之间互连程度的度量。以下各种耦合按从强到弱排列顺序为 ( )\nA 内容耦合，控制耦合，数据耦合，公共环境耦合。\nB 内容耦合，控制耦合，公共环境耦合，数据耦合。\nC 内容耦合，公共环境耦合，控制耦合，数据耦合。\nD 控制耦合，内容耦合，数据耦合，公共环境耦合。",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "37、可行性分析研究的目的( )\nA 争取项目\nB 项目是否值得开发\nC 开发项目\nD 规划项目",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "38、数据字典是用来定义( )中的各个成分的具体含义\nA 流程图\nB 功能结构图\nC 系统结构图\nD 数据流图",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "39、程序的三种基本控制结构的共同特点是( )\nA 只能用来描述简单程序\nB 不能嵌套使用\nC 单入口，单出口\nD 仅用于自动控制系统",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "40、以下说法不正确的是（ ）。\nA. 时序图表示按时间排序的交互，着重表现参与交互对象的生命线和他们交换的信息\nB. 在UML中，识别分析类的来源是用例规约\nC. UML中，存在的静态图有构件图，部署图，用例图，类图和对象图\nD. 在协作图中，描述了类和类之间的交互行为",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "41、黑盒测试在设计测试用例时，主要研究( )\nA 需求规格说明与概要设计说明\nB 详细设计说明\nC 项目开发计划\nD 概要设计说明与详细设计说明",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "42、通过 ( ) 可以完成数据流图的细化。\nA 结构分解\nB 功能分解\nC 数据分解\nD 系统分解",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "43、程序流程图中的箭头代表的是 ( )\nA 数据流\nB 控制流\nC 调用关系\nD 组成关系",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "44、软件定义期问题定义阶段涉及的人员有 ( )\nA 用户、使用部门负责人\nB 软件开发人员、用户、使用部门负责人\nC 系统分析员、软件开发人员\nD 系统分析员、软件开发人员、用户、使用部门负责人",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "45、下面对类之间关系的描述，（ ）是正确的。\nA. 聚集关系中的部分只属于一个整体\nB. 组合关系中整体与部分共存亡\nC. 关联可以表示对象之间的关系\nD. 泛化是表示对象之间的关系",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "46、程序的三种基本控制结构是( )\nA 过程、子程序和分程序\nB 顺序、选择和重复\nC 递归、堆栈和队列\nD 调用、返回和转移",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "47、软件可维护性的特性中相互矛盾的是（ ）。\nA 可修改性和可理解性\nB 可测试性和可理解性\nC 效率和可修改性\nD 可理解性和可读性",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "48、需求分析阶段的任务是确定( )\nA.软件开发方法\nB.软件开发工具\nC.软件开发费\nD.软件系统的功能",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "49、快速原型模型的主要特点之一是( )\nA 开发完毕才见到产品\nB 及早提供全部完整的软件产品\nC 开发完毕后才见到工作软件\nD 及早提供工作软件",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "50、画某系统的数据流图时，顶层图有( )\nA 0张\nB 1张\nC 2张\nD 3张及其以上",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "51、可维护性的特性中相互促进的是( )\nA．可理解性和可测试性\nB．效率和可移植性\nC．效率和可修改性\nD．效率和结构好",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "52、( )是以提高软件质量为目的的技术活动。\nA．技术创新\nB．测试\nC．技术创造\nD．技术评审",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "53、软件测试可能发现软件中的( )，但不能证明软件 ( )。\nA．所有错误，没有错误\nB．错误，没有错误\nC．逻辑错误，没有错误\nD. 设计错误，没有错误",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "55、软件设计一般分为总体设计和详细设计，它们之间的关系是 ( )。\nA．全局和局部\nB．抽象和具体\nC．总体和层次\nD．功能和结构",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "56、在一个课程注册系统中，定义了类 CourseSchedule 和类 Course ，并在类 CourseSchedule 中定义了方法 add (c:Course) 和方法 remove (c:Course)，则类 CourseSchedule 和类 Course 之间的关系是( )。\nA．泛化关系\nB．组合关系\nC．依赖关系\nD．包含关系",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "57、在销售管理系统需求文档中出现下列描述，属于功能需求范畴的是 ( )\nA．系统应能产生月销售报表\nB．系统应在 5 分钟内计算出给定季度的总销售税\nC．对要构建的账户接收系统，必须为月财务状况系统提供更新信息\nD．任取 1 秒钟，一个特定应用所消耗的可用计算能力平均不超过 50％",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "58、在结构化分析方法的基本术语中，数据流的起点称为( )\nA．数据潭\nB．数据存储\nC．加工\nD．数据源",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "59、面向数据流软件设计方法一般是把数据流图中的数据流化分为 ( ) 两种流，再将数据流图映射为软件结构。\nA. 数据流与事务流\nB. 变换流和事务流\nC. 信息流与控制流\nD. 变换流和数据流",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "60、一组模块共同引用一个全局数据项，则该组模块间的耦合类型是 ( )\nA．数据耦合\nB．标记耦合\nC．控制耦合\nD．公共耦合",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "61、软件调试的目的是（ ）。\nA.找出错误所在并改正之\nB.排除存在错误的可能性\nC.对错误性质进行分类\nD.统计出错的次数",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "62、模块（ ）定义为受该模块内一个判断影响的所有模块集合。\nA 控制域\nB 作用域\nC 宽度\nD 接口",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "63. Scrum有一套独特且固定的管理方式，从（ ）几个维度出发，来保证执行过程更高效。\nA．角色、工件\nB. 角色，不同形式的会议\nC．角色、工件、不同形式的会议\nD. 角色、工件、客户需求",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "64、下列关于瀑布模型的描述正确的是（ ）。\nA.瀑布模型的核心是按照软件开发的时间顺序将问题简化\nB.瀑布模型具有良好的灵活性\nC.利用瀑布模型，如果发现问题修改的代价很低\nD. 瀑布模型采用结构化的分析与设计方法，将逻辑实现与物理实现分开",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "65、单元测试是发现编码错误，集成测试是发现模块的接口错误,确认测试是为了发现功能错误，那么系统测试是为了发现（ ）的错误。\nA．接口错误\nB. 编码错误\nC．性能、质量不合要求\nD. 功能错误",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "66、若有一个计算类型的程序，它的输入量只有一个X,其范围是[-1.0，1.0] ，现从输入的\n角度考虑一组测试用例: -1.001, -1.0，1.0, 1. 001。设计这组测试用例的方法是（ ）\nA. 条件覆盖法\nB. 等价分类法\nC. 边界值分析法\nD. 错误推测法",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "67.敏捷开发强调的价值观包括（ ）\nA.个体和交互\nB.严格文档优先\nC.可工作软件优先\nD.客户合作",
      "answer": "参考答案：A、C、D",
      "images": []
    },
    {
      "text": "68、在软件结构设计完成后，对于下列说法，正确的是（ ）\nA 软件层数过多，可能是因为各管理子模块功能过于复杂的原因。\nB 对软件宽度影响最大的因素是扇入。\nC 一个模块的扇出太多，说明该模块过分复杂，缺少中间层\nD 一个模块的扇入太多，说明该模块过分复杂，缺少中间层",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "69、以下说法正确的是（ ）。\nA.等价划分法是一种有效的白盒测试方法。\nB.在等价划分法中，为了提高测试效率，一个测试用例可以覆盖多个有效等价类。\nC.等价划分法的关键是按照用例来确定等价类。\nD.设计测试方案时，要么采用等价划分法，要么采用边界值分析法。",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "71、白盒测试法是通过分析程序的（ ） 来设计测试用例的。\nA.应用范围\nB.功能\nC.内部逻辑\nD.输入数据",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "72、某银行为了使其网上银行系统能够支持信用卡多币种付款功能而进行扩充升级,这\n需要对数据类型稍微进行一些改变，这一状况需要对网上银行系统进行（ ）维护。\nA.正确性\nB.适应性\nC.完善性\nD.预防性",
      "answer": "参考答案：B",
      "images": []
    },
    {
      "text": "73、Scrum中的三种角色包括（ ）。\nA．产品经理、Scrum主管、Scrum团队\nB. 产品经理、Scrum主管、用户\nB．Scrum主管、Scrum团队、测试团队\nC. 产品经理、程序员、用户",
      "answer": "参考答案：A",
      "images": []
    },
    {
      "text": "74、DFD是常用的进行软件需求分析的图形工具，其基本符号是（ ）。\nA.输入、输出、外部实体和加工\nB.变换、加工、数据流和存储\nC.加工、数据流、数据存储和外部实体\nD.变换、数据存储、加工和数据流",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "76、在面向对象方法中，信息隐蔽是通过对象的（ ） 来实现的。\nA分类性 B继承性\nC封装性 D共享性",
      "answer": "参考答案：C",
      "images": []
    },
    {
      "text": "77、采用面向对象方法开发软件的过程中,抽取和整理用户需求并建立问题域精确模型的过程叫（ ）。\nA.面向对象测试\nB.面向对象实现\nC.面向对象设计\nD.面向对象分析",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "78、下面关于面向对象分析与面向对象设计的说法，不正确的是（ ）。\nA.面向对象分析侧重于理解问题\nB.面向对象设计侧重于理解解决方案\nC.面向对象分析描述软件要做什么\nD.面向对象设计一般不关注技术和实现层而的细节",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "79、软件的集成测试工作最好由（ ）人员承担，以提高集成测试的效果。\nA.该软件的设计人员\nB.该软件开发组的负责人\nC.该软件的编程人员\nD.不属于该软件开发组的软件设计人员",
      "answer": "参考答案：D",
      "images": []
    },
    {
      "text": "80、面向对象的分析方法主要是建立三类模型，即（ ）。\nA.系统模型、ER模型、应用模型\nB.对象模型、动态模型、应用模型\nC. E-R模型、对象模型、功能模型\nD.对象模型、动态模型、功能模型",
      "answer": "参考答案：D",
      "images": []
    }
  ],
  "swBlank": [
    {
      "text": "1、一般来说，可以从______、______、______和______四个方面验证软件需求的正确性。",
      "answer": "参考答案：一致性、完整性、现实性、有效性（或可验证性）。",
      "images": []
    },
    {
      "text": "2、可行性分析阶段产生的文档是______；需求分析阶段产生的文档是______，设计阶段产生的文档是______、______。",
      "answer": "参考答案：可行性报告；需求规格说明书；概要设计说明书、详细设计说明书。",
      "images": []
    },
    {
      "text": "3、集成测试的方法主要有______和______。",
      "answer": "参考答案：自顶向下集成测试、自底向上集成测试。",
      "images": []
    },
    {
      "text": "4、编码结束后，首先作单元测试，然后是______、______、______。",
      "answer": "参考答案：集成测试、确认测试、系统测试。",
      "images": []
    },
    {
      "text": "5、在结构化分析模型中，描述软件功能需求的常用动态工具有______图。",
      "answer": "参考答案：数据流。",
      "images": []
    },
    {
      "text": "6、软件生命周期一般可分为：______、______、______、______、______、______、______7个阶段。",
      "answer": "参考答案：问题定义、可行性研究、需求分析、软件设计、编码、软件测试、软件维护。",
      "images": []
    },
    {
      "text": "7、面向对象分析要建立三个模型，其中______模型是三个模型的核心，也是其他两个模型的框架.",
      "answer": "参考答案：对象。",
      "images": []
    },
    {
      "text": "8、结构化分析方法的基本思想是______。",
      "answer": "参考答案：自顶向下、逐层分解。",
      "images": []
    },
    {
      "text": "9、实施精化设计的目标是基于模块的“高内聚低耦合”的原则，提高模块的______。",
      "answer": "参考答案：独立性。",
      "images": []
    },
    {
      "text": "10、在SC图优化过程中，应使模块的控制域包含______。",
      "answer": "参考答案：受该判断影响的模块集合，即作用域。",
      "images": []
    },
    {
      "text": "11、ER图由______组成。",
      "answer": "参考答案：实体、属性、联系。",
      "images": []
    },
    {
      "text": "12、成本效益分析的目的是从______角度评价开发一个项目是否可行。",
      "answer": "参考答案：经济。",
      "images": []
    },
    {
      "text": "13、在结构化分析中，用于描述加工逻辑的主要工具有三种，即：______、______、",
      "answer": "参考答案：结构化语言、判定表、判定树。",
      "images": []
    },
    {
      "text": "14、常见的软件概要设计方法有三大类：以数据流图为基础构造模块结构的______，以数据结构为基础构造模块的______，以对象、类、继承和通信为基础的______。",
      "answer": "参考答案：结构化设计方法、Jackson 方法、面向对象设计方法。",
      "images": []
    },
    {
      "text": "15、在详细设计阶段，采用程序流程图、盒图、 （______） 和伪代码工具描述程序内部的算法逻辑。",
      "answer": "参考答案：PAD 图。",
      "images": []
    },
    {
      "text": "16、______是模块独立性的衡量标准之一，它是指模块的功能强度的度量，即一个模块内部各个元素彼此结合的紧密程度的度量。",
      "answer": "参考答案：内聚性。",
      "images": []
    },
    {
      "text": "17、详细设计的任务是确定每个模块的内部特性，即模块的算法、块内的数据结构______。",
      "answer": "参考答案：接口。",
      "images": []
    },
    {
      "text": "18、所有软件维护申请报告要按规定方式提出，该报告也称______报告。",
      "answer": "参考答案：软件问题报告（或维护请求报告）。",
      "images": []
    },
    {
      "text": "19、内聚性有 7 种类型\n耦合：______。",
      "answer": "参考答案：内聚包括偶然、逻辑、时间、过程、通信、顺序、功能内聚；耦合是模块间相互依赖程度，耦合（由低到高）：非直接耦合、数据耦合、标记耦合、控制耦合、外部耦合、公共耦合、内容耦合。",
      "images": []
    },
    {
      "text": "20、传统软件维护一般分为 4 大类，分别是______。",
      "answer": "参考答案：改正性维护、适应性维护、完善性维护、预防性维护。",
      "images": []
    },
    {
      "text": "21、测试用例包括______和______.",
      "answer": "参考答案：输入数据和预期输出结果。",
      "images": []
    }
  ],
  "swJudge": [
    {
      "text": "1、向滞后的项目中增加人手会使得项目更加滞后。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "2、过程描述语言可以用于描述软件的系统结构。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "3、按照瀑布模型开发软件的一条指导思想是清楚地区分逻辑设计与物理设计，以便尽早开始程序的物理实现。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "4、只有质量差的软件产品才需要维护。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "5、在UML中，类的类型包括边界类，控制类和实体类。当用例比较复杂时，一个用例可以拥有多个控制类。",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "6、建立动态模型的第一步，是编写典型交互行为的脚本。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "7、软件错误可能出现在开发过程的早期，越早修改越好。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "8、软件模块的耦合是越低越好。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "9、一个好的测试用例在于能发现至今未发现的错误。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "10、面向对象设计的结果只能采用面向对象语言来实现( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "11、一个成功的项目唯一提交的就是运行程序。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "12.如果通过软件测试没有发现错误，则说明软件是正确的。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "13.快速原型模型可以有效地适应用户需求的动态变化。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "14、软件工作的考虑范围主要是程序设计和实现。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "15、集成测试主要由用户来完成。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "16、等价类划分方法将所有可能的输入数据划分成若干部分，然后从每一部分中选取少数有代表性的数据作为测试用例。( )",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "17、在进行概要设计时应加强模块间的联系。( )",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "18、在编码中，标准的源代码书写格式有助于改进可读性，所以代码的注释是可有可无的。（ ）",
      "answer": "参考答案：错误",
      "images": []
    },
    {
      "text": "19、在用例图中，角色和角色之间的关系为泛化关系；用例和用例之间的关系有泛化、包含和扩展。（ ）",
      "answer": "参考答案：正确",
      "images": []
    },
    {
      "text": "20、模块化，信息隐藏，抽象和逐步求精的软件设计原则有助于得到高内聚，低耦合度的软件产品。( )",
      "answer": "参考答案：正确",
      "images": []
    }
  ],
  "swShort": [
    {
      "text": "1、什么是用例图，用例图的元素，用例图的画法。",
      "answer": "参考答案：用例图描述参与者与系统用例之间的关系。元素包括参与者、用例、系统边界以及关联、包含、扩展、泛化等关系。画法通常先识别参与者，再识别参与者目标形成用例，最后补充关系和系统边界。",
      "images": []
    },
    {
      "text": "2、可行性研究的研究内容，目的和步骤。",
      "answer": "参考答案：可行性研究从技术、经济、操作、法律/社会、进度等方面判断项目是否值得做。步骤包括明确问题、研究现有系统、提出候选方案、分析比较并形成可行性报告。",
      "images": []
    },
    {
      "text": "3、结构化分析模型都包括哪些？设计模型都包括哪些？分析模型到设计模型的映射关系。",
      "answer": "参考答案：结构化分析模型通常包括数据流图、数据字典、加工说明、ER 图/状态转换图等；设计模型包括软件结构图、接口设计、数据设计、过程设计等。分析模型到设计模型常通过变换分析或事务分析完成映射。",
      "images": []
    },
    {
      "text": "4、衡量模块独立性的两个定性标准是什么？这两个标准的定义分别是什么？在我们的软件设计中，关于模块独立性我们追求的目标是什么？",
      "answer": "参考答案：衡量模块独立性的两个标准是内聚和耦合。内聚指模块内部元素结合紧密程度，耦合指模块之间相互依赖程度。设计目标是高内聚、低耦合。",
      "images": []
    },
    {
      "text": "5、类图的画法，边界类、控制类和实体类的分析方法",
      "answer": "参考答案：类图展示类、属性、操作以及类之间的关联、泛化、聚合、组合、依赖等关系。边界类负责系统与外部交互，控制类协调业务流程，实体类保存业务数据和核心状态。",
      "images": []
    },
    {
      "text": "6、某大型企业计划开发一个 “综合信息管理系统”，该系统涉及销售、供应、财务、生产、人力资源等多个部门的信息管理。该企业的想法是按部门优先级别逐个实现，边应用边开发。对此，需要选择哪种过程模型是最合适的，并说出选择的理由。",
      "answer": "参考答案：适合采用增量模型。系统规模大且按部门优先级逐步实现，增量模型可以先交付核心部门功能，边应用边补充后续部门，降低风险并便于获取反馈。",
      "images": []
    },
    {
      "text": "8、黑盒测试的定义是什么？白盒测试的定义是什么？他们设计测试用例的依据是什么？",
      "answer": "参考答案：黑盒测试把程序看成黑箱，依据需求规格说明设计用例，关注输入输出。白盒测试分析程序内部逻辑结构，依据代码或详细设计设计用例，关注语句、判定、条件、路径等覆盖。",
      "images": []
    },
    {
      "text": "9、如下是关于图书借阅系统的需求描述，请根据要求完成下面的任务。\n（1）请根据描述画出顶层数据流图。\n1）对读者送来的借书证进行验证，并检查该读者的借阅资格（如是否欠费、超限等）；\n2）对通过验证的借书请求，记录借阅信息，并将借出的图书信息及应还日期告知读者；\n3）对读者送来的还书请求进行检查（是否逾期、破损等），更新借阅记录，并生成逾期罚款单（如有）交给读者；\n4）对读者送来的图书查询请求（书名或作者），返回可借书目及馆藏位置信息；\n5）定期统计各类图书的借阅频率及读者借阅排行榜，生成图书借阅分析报告给图书馆管理员图。\n（2）以上描述中，读者的信息由姓名、学院、专业和学号组成；图书由ISBN、书名、出版社、作者、出版日期构成。根据以上信息设计读者和图书的数据字典。（6分）",
      "answer": "参考答案：参考：顶层 DFD 可把“图书借阅系统”作为一个加工，外部实体包括读者、图书馆管理员；输入包括借书证、借书请求、还书请求、查询请求，输出包括借阅信息、应还日期、罚款单、查询结果、统计分析报告。数据字典可定义读者=姓名+学院+专业+学号；图书=ISBN+书名+出版社+作者+出版日期。",
      "images": []
    },
    {
      "text": "10、该考务处理系统的功能需求说明如下，请画出顶层数据流图。\n对考生提交的报名单进行检查。\n对合格的报名单，编好准考证号后，将准考证送给考生，并将汇总后的考生名单送给阅卷站。\n对阅卷站送来的成绩清单进行检查，并根据考试中心制定的合格标准审定合格者。\n制作考生通知单并发放给学生。\n进行成绩分类统计（按地区、文化程度、职业和考试级别等）和试题难度分析，产生统计分析表。",
      "answer": "参考答案：参考：顶层 DFD 中“考务处理系统”为核心加工，外部实体包括考生、阅卷站、考试中心/管理部门。主要数据流有报名单、准考证、考生名单、成绩清单、合格标准、考生通知单、统计分析表。",
      "images": []
    },
    {
      "text": "11、机票预定系统中涉及的机票状态，请画出状态图。\n当新的航空公司入住后，系统管理员会想数据库中添加机票相关信息，该机票进入审核状态；\n当该机票审核通过后，则处于待销售状态；\n销售过程中：\n如果该机票全部销售完毕，则进入售罄状态；\n如果航班取消，机票会进入下架状态；\n机票售罄或下架后，管理员会清空机票信息，机票会进入退出流通状态，最后管理员删除机票。",
      "answer": "参考答案：参考：状态包括审核、待销售、售罄、下架、退出流通、删除/终止。新增机票进入审核；审核通过到待销售；销售完到售罄；航班取消到下架；售罄或下架后清空信息进入退出流通；最后删除。",
      "images": []
    },
    {
      "text": "12、请写出在数据字典中，电话号码的数据条目的定义和组成：\n某宾馆的电话服务如下：可以拨分机号或外线号：\n分机号从7201到7209\n拨外线号需要先按9，然后是市话号码或长话号码\n长话号码是由区号和市话号码组成\n区号是44、55中的任意一个号码\n市话号码是由局号和分局号组成\n局号可以是455、466、888、552中任意一个号码；\n分局号是长度为4的数字串",
      "answer": "参考答案：参考：电话号码=分机号|外线号；分机号=7201|7202|...|7209；外线号=9+市话号码|9+长话号码；长话号码=区号+市话号码；区号=44|55；市话号码=局号+分局号；局号=455|466|888|552；分局号=4位数字串。",
      "images": []
    },
    {
      "text": "13、请画出如下系统的用例图。\n在智能仓库管理系统中，管理员可导入商品入库计划（含商品编号、预期数量、存储要求），并实时查看、调整库位分配方案；仓管员负责划分存储区域、设置货架拣货顺序，并生成最终的库位分配方案；拣货员则能实时查看自己负责区域的拣货任务与区域拣货顺序，同时更新已完成拣货的商品状态，同时仓管员能随时查看当前商品的库存状态。在整个系统中管理员能同时拥有仓管员的权限。",
      "answer": "参考答案：参考：参与者包括管理员、仓管员、拣货员，其中管理员泛化/继承仓管员权限。用例包括导入入库计划、查看调整库位方案、划分存储区域、设置货架拣货顺序、生成库位分配方案、查看拣货任务、查看区域拣货顺序、更新拣货状态、查看库存状态。",
      "images": []
    },
    {
      "text": "14.如下是关于学生学籍与成绩管理系统的需求描述，请根据要求完成下面的任务。\n（1）请根据描述画出顶层数据流图。\n1) 对学生报到提交的录取通知书及个人信息进行核对，生成学号反馈给学生，并建立学生的电子学籍档案；\n2) 对教师录入的课程成绩单进行检查（格式、范围），根据教务处提供的课程合格标准审核合格证，并将成绩单发送给学生，同时将成绩存入学生档案；\n3) 根据学校规定的绩点算法，自动计算每名学生学期平均绩点及学分是否达标，生成学业预警通知；\n4) 对学生提交的转专业或休学申请进行资格审查，审批通过后更新学籍状态并通知相关部门；\n5) 按专业、年级统计各科成绩分布及不及格率，生成教学质量分析报告给教务处。\n（2）以上描述中，学生的录取通知书包括姓名、学院、专业和报道时间；课程成绩单包括课程编号、学号、姓名、平时成绩和卷面成绩。根据以上信息设计录取通知书与课程成绩单的数据字典。",
      "answer": "参考答案：参考：顶层 DFD 可将“学生学籍与成绩管理系统”作为加工，外部实体包括学生、教师、教务处、相关部门。数据流包括录取通知书及个人信息、学号、课程成绩单、课程合格标准、成绩单、学业预警、转专业/休学申请、通知、教学质量分析报告。数据字典：录取通知书=姓名+学院+专业+报道时间；课程成绩单=课程编号+学号+姓名+平时成绩+卷面成绩。",
      "images": []
    }
  ]
};
